#	bitlang/BL_tokens // ☭
# MichiTheCat-RedStar (c) 2026

import re
from string import ascii_letters

# Типы данных: (имя, регуляка)
BIT_TYPES = [ # Соблюдать порядок
	('типСТРОКА', re.compile(r'^"(.+)"$')),
	('типЧИСЛО', re.compile(r'^(-?\d+)$')),
	('типБУЛЕВО', re.compile(r'^(true|false)$')),
	('типПЕРЕМЕННАЯ', re.compile(r'^([a-zA-Z_][a-zA-Z0-9_]*)$')),
]

# Команды: (имя, регулярка, количество аргументов)
BIT_TOKENS = [ # Все аргументы должны быть (.+) | нет, ломается
	('ОТОБРАЖЕНИЕ', re.compile(r'^print!\s+(.+);$'), 1),
	('ВЫВОД', re.compile(r'^print\s+(.+);$'), 1),
	('ПРИБАВИТЬ', re.compile(r'^([a-zA-Z_][a-zA-Z0-9_]*)\s*\+=\s*(.+);$'), 2),
	('ОТНЯТЬ', re.compile(r'^([a-zA-Z_][a-zA-Z0-9_]*)\s*\-=\s*(.+);$'), 2),
	('РАЗДЕЛИТЬ', re.compile(r'^([a-zA-Z_][a-zA-Z0-9_]*)\s*\/=\s*(.+);$'), 2),
	('УМНОЖИТЬ', re.compile(r'^([a-zA-Z_][a-zA-Z0-9_]*)\s*\*=\s*(.+);$'), 2),
	('ОСТАТОК', re.compile(r'^([a-zA-Z_][a-zA-Z0-9_]*)\s*\%=\s*(.+);$'), 2),
	('ПРИСВОИТЬ', re.compile(r'^(.+)\s*=\s*(.+);$'), 2),
	('КОММЕНТАРИЙ', re.compile(r'^//(.*)$'), 0),
	('УСЛОВИЕ', re.compile(r'^if\s+(.+):$'), 1),
	('УСЛОВИЕИНАЧЕ', re.compile(r'^elif\s+(.+):$'), 1),
	('ЦИКЛ', re.compile(r'^while\s+(.+):$'), 1),
	('ПОДСЧЁТ', re.compile(r'^for\s+(.+)..(.+):$'), 2),
	('ИНАЧЕ', re.compile(r'^else:$'), 0),
	('КОНЕЦУСЛОВИЯ', re.compile(r'^end;$'), 0),
	('ЗАДАТЬ', re.compile(r'^input\s+(.+);$'), 1),
	('ИМПОРТ-СИ', re.compile(r'^importC\s+(.+);$'), 1),
	#('ИМПОРТ-БЛ', re.compile(r'^importBL\s+(.+);$'), 1),
	('НЕ', re.compile(r'^not\s+([a-zA-Z_][a-zA-Z0-9_]*);$'), 1),
	('ПРОДОЛЖИТЬ', re.compile(r'^skip;$'), 0),
	('ПРЕРВАТЬ', re.compile(r'^stop;$'), 0),
	('СЛУЧАЙНО', re.compile(r'^random\s+(.+);$'), 1),
]

# -----{ ВАЖНО!!! }----------------------------------------------------
# Не забыватьй о том, что важно соблюдать порядок регклярных выражений!
# Так же после переписывания стали актуальными символы регулярки ^ и $!
# ---------------------------------------------------------------------

BIT_CALCS = {
	'число':[str(x) for x in range(10)], # 0..9
	'алгебраическое':['/', '%', '*', '+', '-', '='], # math
	'логическое':['!', '<', '>', '|', '&'], # logic (символ должен быть один)
	'переменная':[x for x in list(ascii_letters+'_')] # a-zA-Z_
}
